let collect_text = `
棕榈泉国际中心 79115.1 
凯德天府    20850
航利中心    
成都国际科技节能大厦  147600平米
大鼎世纪广场  201127
IMC国际广场 173077平方米
佳年华时代晶座 
凯乐国际    
创新时代广场  320000
天府新谷    434200平米
莱普敦中心   91078平方米
希顿国际广场  238465.78
康普雷斯    90963.5
誉峰国际中心  800000
火炬时代    
东方希望天祥广场 
成都高新孵化园 
航天城上城(商住楼)  33000
曙光国际    
房天下大厦   
世豪广场    
高新万科大厦  
四川投资大厦  
拉德方斯大厦  
博雅城市广场  144008.08
蜀都中心一期  260000平米
蜀都中心二期  260000平方米
天府软件园E区 212491平米
太平洋保险金融大厦   99944.0 
银泰中心    
仁和春天国际花园(商住楼)   
高盛金融中心  354773
AFC中航国际广场   
智地哥谭    
枫丹国际公寓  
高新国际广场  
剑恒发展中心  49123.55m²
新希望国际   
花样年美年广场 
航兴国际广场  
火炬大厦    
新城国际广场  
两江国际    151000平方米
绿地之窗    155961平方米
成都复星国际金融中心  220551
雄川金融中心  
德商国际    
奥克斯广场   
环球时代中心  230000
汇锦广场    
花样年福年广场 23771平米
ACC中航城市广场   202039
川威大厦    50000平方米
复地复城国际  
天合凯旋南城(商住楼) 
吉泰安中心   30000m²
紫光芯云中心  120661
泰合国际金融中心    
ICON大源国际中心  210000
无国界(商住楼)    商住楼没有办公的
新世纪环球中心 1760000
中航国际交流中心    
通威国际中心  79000.0 
星宸国际    19万平米
航天科创中心  
领地环球金融中心    21万㎡
东方希望大厦  
东方希望中心  256277
天府金融大厦  49000.0 
和芯科技大厦  2011
峰汇中心    80054.92㎡
楚峰国际中心  
盈创动力大厦  20000
理想中心    
OCG国际中心 
成都银泰城   
时代晶科1号  
汇顶科技大厦  43000平方米
天府软件园C区 
英联国际    
天合凯旋广场  
布鲁明顿广场  167800㎡
中国水电大厦  76577平方米
中环岛广场   
瑞鑫时代大厦  
新中泰国际大厦 85000
世纪城新国际会展中心办公楼   1000500
天府国际金融中心    
港汇天地    
拓尔思天目中心 106002
拓尔思天目中心 106002
吉泰壹号大厦  47624.97平米
高新智汇园   
新川创新科技园 
微企创意中心  
招商大魔方   763613
天目中心    106002
时尚大厦    
中国欧洲中心  
高新万科中心  同高新创合中心
易上创客中心  
安格斯国际中心 112339
菁蓉国际广场  256000平方米
坤元盛集团大厦 
泰达时代中心  
特拉克斯国际广场    79712
皇庭国际中心  52875.3平米
迈普大厦    
仁和春天国际广场    
天府生命科技园 
东方希望天祥广场(商住楼)   
财智中心    166875平米
长虹科技大厦  125753平米
凤凰国际广场  
丰尚玉林商务港 
知识产权金融大厦    
城南天府大厦  221900
南晶国际南庭  20507
明宇大厦    23327
腾讯大厦    21万平方米
高发大厦    
国窖大厦    
阿里巴巴西部基地    
成达大厦    
天府软件园A区 
吉泰锦江大厦  
西部旅游运营中心    26229㎡
大有智慧    55000㎡
天府软件园G区 160395㎡
瞪羚谷数字文创产业基地 
城市春天8号  231729
天府软件园B区 
润富国际998 53000平米
复地雍湖湾(商住楼)  
首座MAX国际广场   130000
新成国际    
天府软件园D区 
信都大厦    
锦城南府(商住楼)   
香悦城 183882
天华大厦    
天合凯旋南城  
成都地铁OCC办公大楼 61212.8平米
英祥财富领域  112339
大源欢乐颂(商住楼)  
交子金融科技中心    49000
建发天府鹭洲(商住楼) 
三峡大厦    154698
莱普敦公寓   202193
世纪城假日酒店 
佳辰国际中心  
世豪广场世豪瑞丽(商住楼)   
仁美大源印象(商住楼) 
中国建筑西南设计研究院 
和雅嘉御    
ICON创世纪广场   
AI创新中心A区(办公)    
国际创业服务大厦    
肖家河大厦   
世豪瑞丽办公楼 
AI创新中心B区(办公)    
黄龙大厦    
华润时光里   
保利国际广场  
保利星荟    
一品CG(商住楼)   
四川广电中心  
文旅大厦    
中航国际广场  
裕民商业办公楼 
ICON尚郡(商住楼) 
禾泰大厦    
永丰大厦    
南尚国际    18863
中兴通讯大厦  46880
天府国际社区(商住楼) 
仁和春天公寓  
丰尚宜商    
岷江大楼    
长城金融大厦  
搏润科技园   
中海部落阁   
先进科技研发中心    
蓉药大厦    
锦泰保险大厦  
中国国电    222900
携程信息技术大厦    26000
民航快递大厦  
爱斯特大厦   
新和领航    
永丰路11号小区    
依米康科技集团 
麦柯大厦    
誉峰(商住楼) 
首东置业    260000平方米
中兴通讯大厦1 
中粮天府宸悦  
恒大珺临阁   246169平方米
希顿国际广场希尔顿酒店 
大一高新孵化园 
神仙树3号   
美洲中心    
大源欢乐颂(酒店)   
高新创合中心  15万㎡
朗诗熙华府熙华公馆   
里格文化艺术博览中心  
银泰中心in99    720000
雄飞新园名都  
美年中心    
新川万科大厦  
吉泰56    
无国界 486903平方米
大源国际中心  
新成国际公寓  
德必天府五街WE(科技产业园) 
远大购物中心写字楼   
金控集团财智中心    166875.0 
博达四维中心  
HGL7号公馆 306612平米
成都oppo大厦    
枫丹国际    
南阳御龙府世纪星    
中国石油西南油气田科技大厦   49642
东苑锦江派   68134
宇洲国际    
润莱金座(酒店)    130896 m²
四川能投大厦  
博润科技园   
金怡源购物中心 
ICON·大源国际中心二期(办公)   
数字经济大厦  200248
国家开发银行大厦    11890
标卓时代    
联发科技大厦  
融城理想中心  200000
高新区科技工业园    
成都世纪城新国际会展中心    
元公社数智经济产业园  
新南中心写字楼 172521
嘉祥瑞庭南城  
英郡财富领地  
正琪大厦    
依米康产业园  
润和·原筑   48776
石羊工业园(科创路)  
交子金融梦工场 370000
晶立方新经济总部基地  
成都高新区生物医药园  
成都高新区成职软件园  
高新区芳草街道社会组织孵化园  
四川大学华西医院科技园 
芳草街道办事处创业示范基地   
卡尔中心    
互联网创业大厦 
国际西部信息安全产业园南区   
成都市机场路新加坡工业园    
成都高新区女性创新创业服务基地 
成都市科技创业苗圃   
高投ICON和郡    
特拉克思国际广场    
国家软件产业基地    
科园南二路6号(办公) 
国家西部信息产业园   700000平方米
风尚·玉林商务港    
新地物流园区  
民航快递大楼  
晓初公寓    
武侯智慧教育园 
世龙广场    68万㎡
天和国际    565666
金控时代广场  39474平方米
成都高新技术产业开发区 230000
天府生命科技园(科园南路)  
`


var collectStatus = {}
let lines = collect_text.trim().split("\n")
for(i in lines){
    let parts = lines[i].trim().replace(/[\t\s]+/," ").split(" ")
    //console.log(parts)
    let projectName = parts[0].trim()
    if(typeof parts[1] == "undefined"){
        parts[1] = ""
    }
    let projectArea = parts[1]!=""?parts[1].trim():""
    //console.log(projectName,",",projectArea)
    if(typeof collectStatus[projectName] == "undefined"){
        if(projectName == "") continue
        if(projectArea == ""){
            collectStatus[projectName] = 0
        }else{
            collectStatus[projectName] = 1
        }
    }
}

var collectTotal = 0
var collectDone = 0

for( i in collectStatus){
    collectTotal++
    if(collectStatus[i] == 1){
        collectDone++
    }
}

console.log(collectStatus)