let collect_text = `
棕榈泉国际中心	
凯德天府	86（28）65718488
航利中心	18109080911
成都国际科技节能大厦	2883323391
大鼎世纪广场	16732374522
IMC国际广场	13880498214
佳年华时代晶座	
凯乐国际	028-65293300
创新时代广场	69906666
天府新谷	4001516399
天府新谷	4001516399
天府新谷	4001516399
天府新谷	4001516399
天府新谷	4001516399
天府新谷	4001516399
天府新谷	4001516399
莱普敦中心	028-85242222
希顿国际广场	68905666,18180799117
希顿国际广场	68905666,18180799118
希顿国际广场	68905666,18180799119
康普雷斯	
誉峰国际中心	
火炬时代	18683526930
东方希望天祥广场	
成都高新孵化园	400-176-8876
成都高新孵化园	400-176-8876
成都高新孵化园	400-176-8876
成都高新孵化园	400-176-8877
成都高新孵化园	400-176-8878
成都高新孵化园	400-176-8879
成都高新孵化园	400-176-8880
成都高新孵化园	400-176-8881
航天城上城(商住楼)	
曙光国际	
房天下大厦	
世豪广场	
高新万科大厦	
四川投资大厦	6207 3957
拉德方斯大厦	
博雅城市广场	18628180723,18980671228
博雅城市广场	18628180723,18980671228
博雅城市广场	18628180723,18980671228
博雅城市广场	18628180723,18980671228
博雅城市广场	18628180723,18980671228
博雅城市广场	18628180723,18980671228
蜀都中心一期	400-898-8418
蜀都中心二期	400-898-8418
天府软件园E区	
太平洋保险金融大厦	028-87961919
银泰中心	
仁和春天国际花园(商住楼)	
高盛金融中心	13076077707
AFC中航国际广场	
智地哥谭	
枫丹国际公寓	
高新国际广场	
高新国际广场	
高新国际广场	
高新国际广场	
剑恒发展中心	18113157652
新希望国际	
新希望国际	
新希望国际	
花样年美年广场	
航兴国际广场	
火炬大厦	13438183896
新城国际广场	
两江国际	
绿地之窗	
成都复星国际金融中心	13378122424/028-61538883
雄川金融中心	028-84448499；18109080911

德商国际	
奥克斯广场	
环球时代中心	028-86031111（18160020751）
环球时代中心	15828110919
汇锦广场	
花样年福年广场	
ACC中航城市广场	
川威大厦	
复地复城国际	
天合凯旋南城(商住楼)	
吉泰安中心	028-85037661
紫光芯云中心	15608199044
泰合国际金融中心	
ICON大源国际中心	028-88191888

无国界(商住楼)	
新世纪环球中心	4007508888 转 99013
中航国际交流中心	
通威国际中心	028-86168686； 18382021782

星宸国际	16732374522
航天科创中心	
领地环球金融中心	15928751012
东方希望大厦	
东方希望中心	
天府金融大厦	18054792632
和芯科技大厦	19381956764
峰汇中心	
楚峰国际中心	13076077707
盈创动力大厦	
理想中心	
OCG国际中心	M:+86 15202899600 
T:+86 028-65721373-611
E :xdeng@esong.com
OCG国际中心	M:+86 15202899600 
T:+86 028-65721373-611
E :xdeng@esong.com
OCG国际中心	M:+86 15202899600 
T:+86 028-65721373-611
E :xdeng@esong.com
成都银泰城	
时代晶科1号	
汇顶科技大厦	
天府软件园C区	
英联国际	028-85186668
天合凯旋广场	
布鲁明顿广场	
中国水电大厦	13688040083
中环岛广场	
瑞鑫时代大厦	
新中泰国际大厦	18109080911/19828309915/18328160797
世纪城新国际会展中心办公楼	
天府国际金融中心	
天府国际金融中心	
天府国际金融中心	
天府国际金融中心	
港汇天地	028-85559097
拓尔思天目中心	13982068484,18160025681
拓尔思天目中心	13982068484,18160025681
吉泰壹号大厦	13881825322
高新智汇园	028-85559117
新川创新科技园	86 028 8532 2322
微企创意中心	18981790923
招商大魔方	18780021015
	18782920752
时尚大厦	13330894943,13730718895
时尚大厦	13330894943,13730718895
时尚大厦	13330894943,13730718895
中国欧洲中心	86158976
高新万科中心
（同高新创合中心）	028-88855955
易上创客中心	17721871777
安格斯国际中心	
菁蓉国际广场	18281632891
坤元盛集团大厦	18328430249
泰达时代中心	
特拉克斯国际广场	
皇庭国际中心	2886031111
迈普大厦	
仁和春天国际广场	
天府生命科技园	
东方希望天祥广场
(商住楼)	办公租售：028-82802107；82890000；
商业招租：028-85197319；
东方希望天祥广场
(商住楼)	办公租售：028-82802107；82890000；
商业招租：028-85197319；
东方希望天祥广场
(商住楼)	办公租售：028-82802107；82890000；
商业招租：028-85197319；
财智中心	
长虹科技大厦	13880799547
凤凰国际广场	85858585
丰尚玉林商务港	
知识产权金融大厦	
城南天府大厦	028-88855955
南晶国际南庭	4007056811 转 1593
明宇大厦	
腾讯大厦	/
高发大厦	
国窖大厦	
阿里巴巴西部基地	
成达大厦
	
天府软件园A区	
吉泰锦江大厦	
西部旅游运营中心	400-858-3637
大有智慧	
天府软件园G区	028-85331111
瞪羚谷数字文创产业基地	
城市春天8号	
天府软件园B区	028-85331111
润富国际998	84179998
复地雍湖湾(商住楼)	
首座MAX国际广场	16732374522
新成国际	85139088
天府软件园D区	028-61032222；
400-176-8876
信都大厦	
锦城南府(商住楼)	
香悦城	
天华大厦	18080915077
天合凯旋南城	028-83356723
成都地铁OCC办公大楼	/
英祥财富领域	4007056811 转 2493
大源欢乐颂(商住楼)	4001560036
交子金融科技中心	028-60108887
建发天府鹭洲(商住楼)	400-7056-811转 4108
三峡大厦	
莱普敦公寓	028-61101165
世纪城假日酒店	
佳辰国际中心	
世豪广场世豪瑞丽(商住楼)	028-65293711
仁美大源印象(商住楼)	
中国建筑西南设计研究院	
和雅嘉御	
ICON创世纪广场	
AI创新中心A区(办公)	68702303
AI创新中心A区(办公)	68702303
AI创新中心A区(办公)	68702303
AI创新中心A区(办公)	68702303
国际创业服务大厦	
肖家河大厦	
世豪瑞丽办公楼	
AI创新中心B区(办公)	68702303
AI创新中心B区(办公)	68702303
AI创新中心B区(办公)	68702303
AI创新中心B区(办公)	68702303
AI创新中心B区(办公)	68702303
AI创新中心B区(办公)	68702303
AI创新中心B区(办公)	68702303
AI创新中心C区(办公)	68702303
AI创新中心C区(办公)	68702303
AI创新中心C区(办公)	68702303
AI创新中心C区(办公)	68702303
AI创新中心C区(办公)	68702303
AI创新中心C区(办公)	68702303
黄龙大厦	
华润时光里	15881178221
华润时光里	15881178221
华润时光里	15881178221
保利国际广场	
保利星荟	
一品CG(商住楼)	185 8185 4613
四川广电中心	
文旅大厦	
中航国际广场	
裕民商业办公楼	
ICON尚郡(商住楼)	
禾泰大厦	
永丰大厦	
南尚国际	
中兴通讯大厦	
天府国际社区(商住楼)	
仁和春天公寓	028-65260011
丰尚宜商	
岷江大楼	
长城金融大厦	
搏润科技园	
中海部落阁	
先进科技研发中心	
蓉药大厦	
锦泰保险大厦	
中国国电	
携程信息技术大厦	
携程信息技术大厦	
民航快递大厦	
爱斯特大厦	
新和领航	
永丰路11号小区	
依米康科技集团	
麦柯大厦	
誉峰(商住楼)	
首东置业	
中兴通讯大厦1	
中粮天府宸悦	
恒大珺临阁	
希顿国际广场希尔顿酒店	
大一高新孵化园	
神仙树3号	
美洲中心	
大源欢乐颂(酒店)	
高新创合中心	
朗诗熙华府熙华公馆	
里格文化艺术博览中心	
银泰中心in99	18482011907
雄飞新园名都	
美年中心	18108074599
美年广场	
美年广场	
美年广场	
金控集团财智中心	
高新创智广场	82128888
高新创智广场	82128888
高新创智广场	82128888
吉泰56	
无国界	18227696075
大源国际中心	
新成国际公寓	85139088
德必天府五街WE(科技产业园)	028-62071888
远大购物中心写字楼	18180232124
金控集团财智中心	
金控集团财智中心	
金控集团财智中心	
金控集团财智中心	
金控集团财智中心	
金控集团财智中心	
博达四维中心	
HGL7号公馆	
成都oppo大厦	68386288
枫丹国际	
南阳御龙府世纪星	400-819-2059 转 1555
中国石油西南油气田科技大厦	
东苑锦江派	
宇洲国际	
润莱金座(酒店)	
四川能投大厦	
博润科技园	
金怡源购物中心	
ICON·大源国际中心二期(办公)	
数字经济大厦	13618088877
国家开发银行大厦	
标卓时代	
联发科技大厦	62071888
联发科技大厦	
融城理想中心	18109080911
高新区科技工业园	028-86055256
成都世纪城新国际会展中心	
元公社数智经济产业园	028-88855955
新南中心写字楼	
嘉祥瑞庭南城	13438367046
嘉祥瑞庭南城	18202845918
正琪大厦	
依米康产业园	
润和·原筑	
石羊工业园(科创路)	
交子金融梦工场	13111881229
晶立方新经济总部基地	
成都高新区生物医药园	
成都高新区成职软件园	
高新区芳草街道社会组织孵化园	
四川大学华西医院科技园	
芳草街道办事处创业示范基地	
卡尔中心	028-66697666,028-86678166
互联网创业大厦	
国际西部信息安全产业园南区	
成都市机场路新加坡工业园	
成都高新区女性创新创业服务基地	
成都市科技创业苗圃	
高投ICON和郡	
特拉克思国际广场	
国家软件产业基地	400-176-8876
科园南二路6号(办公)	
国家西部信息产业园	13981946398
风尚·玉林商务港	
新地物流园区	
民航快递大楼	
晓初公寓	
武侯智慧教育园	
世龙广场	
天和国际	
金控时代广场	
成都高新技术产业开发区	
天府生命科技园(科园南路)	
天益国际	15982298915
西藏银行成都基地	
`


var collectStatus = {}
let lines = collect_text.trim().split("\n")
for(i in lines){
    let parts = lines[i].trim().replace(/[\t\s]+/," ").split(" ")
    //console.log(parts)
    let projectName = parts[0].trim()
    if(typeof parts[1] == "undefined"){
        parts[1] = ""
    }
    let projectArea = parts[1]!=""?parts[1].trim():""
    //console.log(projectName,",",projectArea)
    if(typeof collectStatus[projectName] == "undefined"){
        if(projectName == "") continue
        if(projectArea == ""){
            collectStatus[projectName] = 0
        }else{
            collectStatus[projectName] = 1
        }
    }
}

var collectTotal = 0
var collectDone = 0

for( i in collectStatus){
    collectTotal++
    if(collectStatus[i] == 1){
        collectDone++
    }
}

console.log(collectStatus)